brew 'mas'

brew 'git'
brew 'git-lfs'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'moreutils'
brew 'openssl'
brew 'ripgrep'
brew 'vim'

brew 'gpg'
brew 'pinentry-mac'

brew 'kubernetes-cli'
brew 'kubectx'
brew 'stern'

brew 'shellcheck'
brew 'shfmt'

cask_args appdir: "/Applications"
cask 'p4v'

# Editors
cask 'visual-studio-code'

# Tools
cask '1password-cli'

# Fonts
cask 'homebrew/cask-fonts/font-hack'

# Languages
cask 'adoptopenjdk'
brew 'clojure'
brew 'elixir'
brew 'go'
brew 'python'
brew 'rbenv'
brew 'ruby-build'
