cask_args appdir: "/Applications"

# Installers
brew 'mas'

# Editors
brew 'vim'
cask 'visual-studio-code'

# Tools
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'graphviz'
brew 'htop'
brew 'jq'
brew 'libpq' # for pg gem
brew 'moreutils'
brew 'openssl'
brew 'pinentry'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'stern'
brew 'trivy'
brew 'yq'
cask '1password-cli'
cask 'p4v'

# Fonts
cask 'homebrew/cask-fonts/font-hack'

# Languages
cask 'temurin'
brew 'elixir'
brew 'go'
brew 'python'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'
brew 'nvm'

# Environments
tap 'heroku/brew'
brew 'heroku'
brew 'kubectx'
brew 'kubernetes-cli'
