brew 'git'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'moreutils'
brew 'openssl'
brew 'the_silver_searcher'
brew 'vim'

brew 'gpg'
brew 'pinentry-mac'

brew 'kubernetes-cli'
brew 'kubectx'
brew 'stern'

brew 'clojure'
brew 'python'
brew 'rbenv'
brew 'ruby-build'

brew 'shellcheck'
brew 'shfmt'

cask_args appdir: "/Applications"
cask 'p4v'
